STMicroelectronics/STM32CubeF7/Projects/STM32F769I-Discovery/Applications/WiFi/Esp8266_IAP_Client/Src/main.c
/**
  ******************************************************************************
  * @file    WiFi/Esp8266_IAP_Client/Src/main.c
  * @author  MCD Application Team
  * @brief   This sample code shows how to use the ESP8266 WiFi module to download 
  *          a fw from a http server, write it into the flash then jump to run it.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
  
/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "main.h"
#include "esp8266.h"
#ifdef USE_LCD
#include "lcd_log.h"
#endif /* USE_LCD */
#include "flash_if.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define HTML_SUCCESS_STRING "200 OK"
#define VSYNC               1 
#define VBP                 1 
#define VFP                 1
#define VACT                480
#define HSYNC               1
#define HBP                 1
#define HFP                 1
#define HACT                800

#define LAYER0_ADDRESS               (LCD_FB_START_ADDRESS)
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
typedef  void (*pFunction)(void);
pFunction Jump_To_Application;
uint32_t JumpAddress;
static uint8_t HtmlData[DATA_MAX_SIZE];
static uint8_t HtmlRequest[256];
static uint32_t FlashWriteAddress;
uint8_t IpAddress[15];

/* Private typedef -----------------------------------------------------------*/
extern LTDC_HandleTypeDef hltdc_discovery;
extern DSI_HandleTypeDef hdsi_discovery;
DSI_CmdCfgTypeDef CmdCfg;
DSI_LPCmdTypeDef LPCmd;
DSI_PLLInitTypeDef dsiPllInit;
static RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;

/* Private function prototypes -----------------------------------------------*/
static void MPU_Config(void);
static void SystemClock_Config(void);
static void ErrorHandler(void);
static void StartWiFiIAP(void);
static void CPU_CACHE_Enable(void);


#ifdef USE_LCD
 static void LCDConfig(void);
 static void LTDC_Init(void);
#endif /* USE_LCD */

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */

int main(void)
{
  uint32_t Trial = 0;
  ESP8266_StatusTypeDef Status; 

  /* Configure the MPU attributes */
  MPU_Config();

  /* Enable the CPU Cache */
  CPU_CACHE_Enable();
  
  /* STM32F7xx HAL library initialization:
       - Configure the Flash ART accelerator on ITCM interface
       - Configure the Systick to generate an interrupt each 1 msec
       - Set NVIC Group Priority to 4
       - Global MSP (MCU Support Package) initialization
     */

  HAL_Init();

  /* Configure the system clock to 200 MHz */
  SystemClock_Config();

  /* Initialize the SDRAM */
  BSP_SDRAM_Init();
  
  /* Configure leds */
  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);
  
  /* Configure Key Button */      
  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_GPIO);  

  /* Test if Key Tamper -button on STM32F769I-Discovery Board is not pressed */
  if (BSP_PB_GetState(BUTTON_USER) == 0x00)
  { /* Key Tamper -button not pressed: jump to user application */
    
    /* Check if valid stack address (RAM address) then jump to user application */
    if (((*(__IO uint32_t*)USER_FLASH_FIRST_PAGE_ADDRESS) & 0x2FFE0000 ) == 0x20000000)
    {
      /* Jump to user application */
      JumpAddress = *(__IO uint32_t*) (USER_FLASH_FIRST_PAGE_ADDRESS + 4);
      Jump_To_Application = (pFunction) JumpAddress;
      
      /* Initialize user application's Stack Pointer */
      __set_MSP(*(__IO uint32_t*) USER_FLASH_FIRST_PAGE_ADDRESS);
      Jump_To_Application();
    }
  }
 
#ifdef USE_LCD
  /* Configure LCD */
  LCDConfig();
    BSP_LCD_LayerDefaultInit(0, LAYER0_ADDRESS);     
  BSP_LCD_SelectLayer(0); 
  
  /* Initialize the log unit */
  LCD_LOG_Init();
  /* Send Display On DCS Command to display */
  HAL_DSI_ShortWrite(&(hdsi_discovery),
                     0,
                     DSI_DCS_SHORT_PKT_WRITE_P1,
                     OTM8009A_CMD_DISPON,
                     0x00);

  BSP_LCD_SetTextColor(LCD_COLOR_BLUE); 
  BSP_LCD_FillRect(0, 0, 800, 112);
  
  /* Write the demo header log */
  LCD_LOG_SetHeader((uint8_t *)"WiFi IAP Demo");
    /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
  HAL_Delay(1000);
#endif /* USE_LCD */
  
#ifdef USE_LCD
  LCD_UsrLog("Initializing Wifi module...\n");
    /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */

  /* Initialize the WiFi module ESP8266 */
  Status = ESP8266_Init();
   
  /* Check if initialization passed */
  if (Status != ESP8266_OK)
  {
#ifdef USE_LCD
   LCD_ErrLog("Initializing Wifi module  Failed!\n\n");
     /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */
    ErrorHandler();
  }
#ifdef USE_LCD
  else
  {
   LCD_UsrLog("O.K!\n\n");
     /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
  }
  
  /* Join Access Point defined by user */
  LCD_UsrLog("Joining Access Point  ' "WIFI_SSID " ' ...\n");
    /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */
  while(ESP8266_JoinAccessPoint((uint8_t *)WIFI_SSID, (uint8_t *)WIFI_PASSWORD) != ESP8266_OK)
  {
#if USE_LCD
    LCD_UsrLog("Retrying ( %d )to Join Access Point  "WIFI_SSID"\n\n",  (int)++Trial);
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */
    if (Trial == MAX_NUM_TRIAL)
      break;
  }
  
  /* Check if maximum number of trials has been reached */
  if (Trial == MAX_NUM_TRIAL)
  {
#if USE_LCD
    LCD_ErrLog("Joining Access Point  ' "WIFI_SSID" '  Failed!\n\n");
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */
    ErrorHandler();
  }
  else
  {
	/* Reset the IP address field to 0 */
    memset(IpAddress, '\0', 15);
	
	/* Access point joined: start getting IP address */    
    ESP8266_GetIPAddress(ESP8266_STATION_MODE, IpAddress);
#ifdef USE_LCD
    LCD_UsrLog("OK!\nGot IP Address: %s\n\n", (char *)IpAddress);
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */
    HAL_Delay(1000);
   }
  /* IP Address acquired: Start the IAP over WiFi (retrieve the binary file 
     for server and download it to Flash memory) */
  StartWiFiIAP();
}

static void StartWiFiIAP(void)
{
  uint8_t *FwData;
  uint32_t FwSize;
  uint32_t DataSize = 0;
  uint32_t Trial = 0;
  
  ESP8266_ConnectionInfoTypeDef ConnectionInfo;
  ESP8266_StatusTypeDef Result = ESP8266_OK;

  /* Initialize the HTML request field to 0 */
  memset(HtmlRequest, '\0', 128);
  
