STMicroelectronics/STM32CubeF7/Projects/STM32F769I-Discovery/Applications/WiFi/Esp8266_IAP_Client/Src/main.c
  /*
    Send an HTML GET request to download the "FW_FILE", the request is as follows
   ====================================
    GET /<fw_file> HTTP/1.1
    Host: <http_server>
    User-Agent: <esp8266_for_example>
    Accept: * / *  <= no space here
    Connection: keep-alive
   ====================================
   the request MUST end with a "\r\n\r\n" otherwise it won't be processed correctly.
   */
  sprintf((char *)HtmlRequest, "GET /"FW_FILE" HTTP/1.1%c%cHost: "HOST_ADDRESS"%c%cUser-Agent: esp8266/stm32%c%cAccept: */*%c%cConnection: keep-alive%c%c%c%c",
                      '\r','\n','\r','\n','\r','\n','\r','\n','\r','\n','\r','\n');

#ifdef USE_LCD
    LCD_UsrLog("Connecting to %s:%d ...\n", HOST_ADDRESS, HOST_PORT);
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */
 
  /* Initialize Connection info structure */
  Trial = 0;
  memset(&ConnectionInfo, '\0', sizeof (ESP8266_ConnectionInfoTypeDef));
  
  ConnectionInfo.connectionType = ESP8266_TCP_CONNECTION;
  ConnectionInfo.ipAddress = (uint8_t *)HOST_ADDRESS;
  ConnectionInfo.isServer = ESP8266_FALSE;
  ConnectionInfo.port = HOST_PORT;

  /* Wait for communication establishment */
  while (ESP8266_EstablishConnection(&ConnectionInfo) != ESP8266_OK)
  {
#ifdef USE_LCD
    LCD_UsrLog("Retrying( %d ) to connect to %s:%d \n", (int)++Trial, HOST_ADDRESS, HOST_PORT);
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
    HAL_Delay(1000);

#endif /* USE_LCD */

    if (Trial == MAX_NUM_TRIAL)
    {
      break;
    }
  }
    
  /* Check if trials number exceeded maximum limit */
  if (Trial == MAX_NUM_TRIAL)
  {
#ifdef USE_LCD
    LCD_ErrLog("Connecting to %s:%d  Failed!\n", HOST_ADDRESS, HOST_PORT);
    LCD_ErrLog("Quitting Access Point...\n\n");
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */

    /* Leave the access point */
    ESP8266_QuitAccessPoint();
	
	/* Deinitialize the WiFi module */
    ESP8266_DeInit();
    
	/* Call the error Handler */
    ErrorHandler();
  }
  
#ifdef USE_LCD
  else
  {
    LCD_UsrLog("O.K!\n\n");
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
    HAL_Delay(1000);
  }
#endif /* USE_LCD */
  
  /* Reset the HTML data field to 0 */
  memset(HtmlData, '\0', ARRAY_SIZE(HtmlData));

#ifdef USE_LCD
    LCD_UsrLog("Downloading the firmware ' "FW_FILE" '...\n");
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */

  Result = ESP8266_SendData(HtmlRequest, strlen((char *)HtmlRequest));

  /* In case of error, quit the Access point */  
  if (Result != ESP8266_OK)
  {
#ifdef USE_LCD
    LCD_ErrLog("Downloading the firmware ' "FW_FILE" '  Failed!\n");
    LCD_ErrLog("Quitting Access Point...\n\n");
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */   

	/* Deinitialize the WiFi module */
    ESP8266_DeInit();
    
	/* Call the error Handler */
    ErrorHandler();
  }
     
  /* Check whether the data was correctly received.
     This is can be done by checking the GET request response.
     in case of success the string '200 OK' is received.
     see (https://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html) */
  Result = ESP8266_ReceiveData(HtmlData, DATA_MAX_SIZE, &DataSize);
    
  /* If data reception failed */
  if (Result != ESP8266_OK)
  {
#ifdef USE_LCD
    LCD_ErrLog("Downloading the firmware ' "FW_FILE" '  Failed!\n");
    LCD_ErrLog("Quitting Access Point...\n\n");
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */   

    /* Leave the access point */
    ESP8266_QuitAccessPoint();
	
	/* Deinitialize the WiFi module */
    ESP8266_DeInit();
    
	/* Call the error Handler */
    ErrorHandler();
  }
  
  /* If data reception passed */
  if(strstr((char *)HtmlData, HTML_SUCCESS_STRING) == NULL)
  {
#ifdef USE_LCD
    LCD_ErrLog("Downloading the firmware ' "FW_FILE" '  Failed!\n");
    LCD_ErrLog("Quitting Access Point...\n\n");
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */

    /* Leave the access point */
    ESP8266_QuitAccessPoint();
	
	/* Deinitialize the WiFi module */
    ESP8266_DeInit();
    
	/* Call the error Handler */
    ErrorHandler();
  }
  
  /* The actual fw data is located after the HTML HEADER
   the end of header is marked with the string "\r\n\r\n" */
  FwData = (uint8_t *)(strstr((char *)HtmlData, "\r\n\r\n"));
  
  /* Check if data is null */
  if (FwData != NULL)
  {
	 /* Increment data pointer by 4 to get the data load */
     FwData += 4;
  
    /* Stop WiFi module to avoid errors when erasing flash */
    ESP8266_DeInit();
    
    /* The actual fw data size can be retrieved from the html header
       by looking at the "Content-Length" field.
       but let's do it in a faster way: FwSize = DataSize - (FwData - HtmlData) */
    FwSize = DataSize - (FwData - HtmlData);
  
#ifdef USE_LCD
    LCD_UsrLog("Downloaded firmware ' %s ', size = %ld Bytes\n\n", FW_FILE, FwSize);
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
    HAL_Delay(1000);
#endif /* USE_LCD */
  
    /* Now the firmware can be written into Flash memory */
#ifdef USE_LCD
    LCD_UsrLog("State: Programming...\n");
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */

    /* Initialize the Flash memory module for write operations */
    FLASH_If_Init();

    /* Erase 2 sectors, 128KB each (the downloaded firmware size doesn't exceed 192KB) */
    FLASH_If_Erase(USER_FLASH_FIRST_PAGE_ADDRESS);
    FLASH_If_Erase(USER_FLASH_SECOND_PAGE_ADDRESS);

	/* Set the write address */
    FlashWriteAddress = USER_FLASH_FIRST_PAGE_ADDRESS; 
  
    /* Start writing the binary file into the Flash memory */
    if (FLASH_If_Write(&FlashWriteAddress, (uint32_t*)FwData, FwSize) != 0)
    {
#ifdef USE_LCD
      LCD_ErrLog("Programming Failed !\n");
        /*Refresh the LCD display*/
      HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */
		/* Leave the access point */
    ESP8266_QuitAccessPoint();
	
	  /* Deinitialize the WiFi module */
    ESP8266_DeInit();
    
	  /* Call the error Handler */
    ErrorHandler();
    }
    else
    {
#ifdef USE_LCD
     LCD_UsrLog("Programming Done !\n");
       /*Refresh the LCD display*/
     HAL_DSI_Refresh(&hdsi_discovery);
#endif
    }
  }
  else
  {
#ifdef USE_LCD
    LCD_ErrLog("The firmware ' "FW_FILE" ' is empty\n");
    LCD_ErrLog("Quitting Access Point...\n\n");
      /*Refresh the LCD display*/
    HAL_DSI_Refresh(&hdsi_discovery);
#endif /* USE_LCD */

    /* Leave the access point */
    ESP8266_QuitAccessPoint();
	
	/* Deinitialize the WiFi module */
    ESP8266_DeInit();
    
	/* Call the error Handler */
    ErrorHandler();
  }
  
